app/controllers/board_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
	  @posts = Post.all #post 모델의 모든게 선택되서 @posts변수에 닮김

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1231"], ["content", "12331"], ["created_at", "2020-11-22 15:16:42.148652"], ["updated_at", "2020-11-22 15:16:42.148652"]]
---
  def create
	  title1 = params[:title]
	  content1 = params[:content]
	  Post.create(title: title1, content: content1)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "aaaa"], ["content", "bbb"], ["updated_at", "2020-11-23 01:20:37.397223"], ["id", 2]]
---
  def update
	  @post = Post.find(params[:id]) #id를 통해서 row를 찾음
	  @post.title = params[:title]
	  @post.content = params[:content]
	  @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def delete
	  @post = Post.find(params[:id])
	  @post.destroy